export const optionsPerson = [
  "Друг",
  "Кум",
  "Подруга",
  "Кума",
  "Сусід",
  "Брат",
  "Сестра",
  "Колега",
  "Партнер",
  "Побратим",
  "Керівник",
  "Бабуся",
  "Дідусь",
  "Коханий",
  "Кохана",
  "Мама",
  "Тато",
  "Дядько",
  "Тьотя",
  "Дочка",
  "Син",
  "Онучка",
  "Онук",
  "Племінник",
  "Племінниця",
];

export const ageOptions = Array.from({ length: 101 }, (_, i) => ({
  value: i,
  label: `${i} років`,
})).filter((opt) => opt.value > 0);

export const optionsGreetingSubject = [
  "День народження",
  "Річниця",
  "День ангела",
  "Весілля",
  "Підвищення",
  "Покупка",
  "Професійне свято",
  "Календарне свято",
  "Мемний день",
];

export const optionsHobbies = [
  "Автомобілі",
  "Садівництво",
  "Риболовля",
  "Кулінарія",
  "Домашні улюбленці",
  "Родина",
  "Мотоцикли",
  "Спорт",
  "Танці",
  "Музика",
  "Фото",
  "IT",
  "Відео-ігри",
  "Домашня майстерня",
  "Вишивка",
  "Мода та стиль",
];
export const cardStyleOptions = ['Мультяшний', 'Діловий', 'Техно', 'В стилі картини'];